/*
 * Copyright (C) 2023 - 2024 Frms, All Rights Reserved.
 *
 * This file(DataTest.kt) is part of E纸千金.
 *
 * E纸千金 is free software:
 * you can redistribute it and/or modify it under the terms of the GNU General Public License as published
 * by the Free Software Foundation, either version 3 of the License, or (at your option) any later version.
 *
 * E纸千金 is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY;
 * without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
 * See the GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License along with E纸千金.
 * If not, see <https://www.gnu.org/licenses/>.
 */
package org.frms.paper.equal.gold.datas

import org.frms.paper.equal.gold.R

/**
 * 测试数据
 * @author Frms(Frank Miles)
 * @email 3505826836@qq.com
 * @time 2023/06/13 下午 07:50
 */

const val INTENT_SHOP_MESSAGE = "shop"

val shopMessageList = arrayListOf(
	"《钢铁是怎样炼成的》" to "讲述保尔·柯察金从一个不懂事的少年成为一个忠于革命的布尔什维克战士，再到双目失明却坚强不屈创作小说。小说真实而深刻地描绘了十月革命前后乌克兰地区的广阔生活画卷，塑造了以保尔·柯察金为代表的一代英雄的光辉形象。主人公保尔·柯察金的童年，过的是最底层的苦难生活。年轻的保尔为拯救陷入敌手的老布尔什维克朱赫来而遭逮捕，在狱中表现得坚贞不屈，出狱后参军，在柯托夫斯基骑兵旅和布琼尼骑兵团中转战疆场，浴血奋战，身负重伤后以惊人的忍耐力使医生们深为敬佩。",
	"《平凡的世界》" to "《平凡的世界》是中国作家路遥创作的一部全景式地表现中国当代城乡社会生活的百万字长篇小说。全书共三部。该书以中国70年代中期到80年代中期十年间为背景，通过复杂的矛盾纠葛，以孙少安和孙少平两兄弟为中心，刻画了当时社会各阶层众多普通人的形象；劳动与爱情、挫折与追求、痛苦与欢乐、日常生活与巨大社会冲突纷繁地交织在一起，深刻地展示了普通人在大时代历史进程中所走过的艰难曲折的道路。",
	"《三体》" to "《三体》是刘慈欣创作的长篇科幻小说系列，由《三体》《三体2：黑暗森林》《三体3：死神永生》组成，第一部于2006年5月起在《科幻世界》杂志上连载，第二部于2008年5月首次出版，第三部则于2010年11月出版。作品讲述了地球人类文明和三体文明的信息交流、生死搏杀及两个文明在宇宙中的兴衰历程。其第一部经过刘宇昆翻译后获得了第73届雨果奖最佳长篇小说奖。",
	"《百年孤独》" to "《百年孤独》，是哥伦比亚作家加西亚·马尔克斯创作的长篇小说，是其代表作，也是拉丁美洲魔幻现实主义文学的代表作，被誉为“再现拉丁美洲历史社会图景的鸿篇巨著”。作品描写了布恩迪亚家族七代人的传奇故事，以及加勒比海沿岸小镇马孔多的百年兴衰，反映了拉丁美洲一个世纪以来风云变幻的历史。作品融入神话传说、民间故事、宗教典故等神秘因素，巧妙地糅合了现实与虚幻，展现出一个瑰丽的想象世界，成为20世纪重要的经典文学巨著之一。",
	"《明朝那些事儿》" to "《明朝那些事儿》主要讲述的是从1344年到1644年这三百年间关于明朝的一些故事。以史料为基础，以年代和具体人物为主线，并加入了小说的笔法，语言幽默风趣。对明朝十六帝和其他王公权贵和小人物的命运进行全景展示，尤其对官场政治、战争、帝王心术着墨最多，并加入对当时政治经济制度、人伦道德的演义。",
	"《追风筝的人》" to "《追风筝的人》是美籍阿富汗作家卡勒德·胡赛尼（Khaled Hosseini）的第一部长篇小说，译者李继宏，上海人民出版社于2003年出版，是美国2005年的排名第三的畅销书。\n" + "全书围绕风筝与阿富汗的两个少年展开，讲述了一个富家少年与家中仆人，关于人性的背叛与救赎的故事\n",
	"《许三观卖血记》" to "《许三观卖血记》是中国当代作家余华创作的长篇小说。《许三观卖血记》中讲述了一个悲喜交加的感人故事。许三观靠着卖血渡过了人生的一个个难关，战胜了命运强加给他的惊涛骇浪，而当他老了，知道自己的血再也没有人要时，精神却崩溃了。小说中平凡的小人物挣扎于浮沉的时代，用他们并不厚实的臂膀不断拍打出激荡的浪花，观望着模糊的前路，而其间的苦难与悲情却又清晰可见，平凡之家的悲剧喜剧在余华细腻的笔触下显得可笑而又可怜。在讽刺幽默的行文之间又可看出人物苦中作乐的无奈，以及现实与理想之间永远也无法抹平的鸿沟。",
)

val shopPainterList = arrayListOf(
	arrayListOf(R.drawable.t_s_1, R.drawable.ts1_1, R.drawable.ts1_2, R.drawable.ts1_3),
	arrayListOf(R.drawable.t_s_2, R.drawable.ts2_1, R.drawable.ts2_2, R.drawable.ts2_3),
	arrayListOf(R.drawable.t_s_3, R.drawable.ts3_1, R.drawable.ts3_2, R.drawable.ts3_3),
	arrayListOf(R.drawable.t_s_4, R.drawable.ts4_1, R.drawable.ts4_2, R.drawable.ts4_3),
	arrayListOf(R.drawable.t_s_5, R.drawable.ts5_1, R.drawable.ts5_2, R.drawable.ts5_3),
	arrayListOf(R.drawable.t_s_6, R.drawable.ts6_1, R.drawable.ts6_2, R.drawable.ts6_3),
	arrayListOf(R.drawable.t_s_7, R.drawable.ts7_1, R.drawable.ts7_2, R.drawable.ts7_3),
)

val shopPrice = arrayListOf(
	80 to 65, 90 to 45, 108 to 99, 198 to 139, 59 to 59, 79 to 63, 69 to 49
)

const val sell_info =
	"审核不通过的书籍保留三日，如需寄回请务必在三日内操作回寄，超过三日书籍将被统一清理，无法再进行回寄，审核不通过的书籍无法获得卖书款。回寄需要您自行承担相应运费。审核通过的书籍不支持回寄。"

//const val donate_info = ""

val exchangePainterList = arrayListOf(
	R.drawable.ex1, R.drawable.ex2, R.drawable.ex3, R.drawable.ex4
)

val exchangeNameList = arrayListOf(
	"精美纸质书签" to 10, "多色记号笔" to 20, "明信片" to 30, "定制帆布袋" to 40
)

val newsMessage = arrayListOf(
	"筑梦公益赠书项目" to "	大爱人间，促进乡村教育发展，筑梦公益赠书700万本书" + "\n  筑梦公益赠书项目负责人表示，一方面是乡村图书资源的匮乏，另一方面是积极响应国家重大战略全民阅读计划，现如今一套图书的价格随着成本的增加也是水涨船高，这对于农村家庭来说仍然是一笔高昂的开支。“我们做这个项目，希望是可以减少农村家庭的支出，仅以邮费的一小部分钱就可以让小孩徜徉在知识的海洋。”", "湘潭市捐书活动" to "	湘潭市公积金中心开展公益捐书活动\n" + "  “这是我又找到的一些幼儿图书，可以给社区小朋友看。”近日，湘潭市住房公积金管理中心（以下简称“公积金中心”）组织党员干部开展“心相莲·书香承”公益捐书活动。", "爱心助力，情暖冬日 " to "	一本书·爱心粥首次捐书活动圆满成功\n" + "  一本书，可能只有一厘米的厚度，但对于缺乏书籍的乡村孩子来说，却是一个全新的世界。以书本传递爱，让孩子们在书中享受美的熏陶，在斑斓的梦里快乐成长，用爱与希望织成星光，洒向山间旷野。", "世界读书日，一起捐书，为爱守候" to "	中国儿童少年基金会肯德基小候鸟基金推出“等候一本书”公益活动\n" + "  截至2023年年初，小候鸟基金已在全国27个省份设立2000余个“小候鸟图书角”，捐赠优质童书约100万册，开展了4万余场主题活动，累计惠及儿童500余万人次，给“小候鸟”带去精神滋养和心灵陪伴。",

	"青年志愿者协会" to "	书送爱心，点亮梦想”图书捐赠活动圆满落幕\n" + "  年志愿者协会通过图书捐赠活动，广泛凝聚爱心，架起一座桥梁，充分彰显志愿活动“奉献，友爱，互助，进步”的宗旨，为丰富边远地区阅读资源尽一份绵薄之力。"
)

val newsInfo = arrayListOf(
	"    从2021年12月开始，筑梦公益赠书项目正式推出，旨在通过爱心公益赠书，让更多孩子爱上阅读，助力孩子们的梦想生根发芽。\n" + "    截至目前，筑梦公益赠书整合了国内知名出版社，项目方和出版社共同承担图书费用，每月1期，领书人仅需要花费15元邮费，即可领取到3本~40本不等的一套图书。截至目前，活动已经进行了7个月，送出了700多万本图书，遍及云南、广西、贵州、新疆、西藏、青海等地。\n" + "    据筑梦公益赠书项目负责人介绍，“项目初心是希望更多的小孩可以远离电子产品，帮助更多的孩子们养成阅读习惯。做了很多期后，发现在偏远地区的乡村儿童亟需课外读物，我们也希望促进乡村教育的发展。”\n" + "    根据中国扶贫基金会、北京师范大学中国公益研究院2018年发布的《乡村儿童阅读报告》显示，高达74%的受访乡村儿童一年阅读的课外读物不足10本，超过36%的儿童一年的阅读量不足3本，1本课外读物都没有的乡村儿童占比接近20%。与城市儿童年阅读量超过10本的情况形成鲜明对比。\n",

	"    “这是我又找到的一些幼儿图书，可以给社区小朋友看。”近日，湘潭市住房公积金管理中心（以下简称“公积金中心”）组织党员干部开展“心相莲·书香承”公益捐书活动。\n" + "    活动倡议一经发出，便得到了公积金中心广大党员干部的积极响应、踊跃参与，活动期间，共收到大家捐赠的书籍300余册，涵盖经典名著、现代文学、儿童文学、自然科学、社会科学等类别，极大丰富联点社区东坪街道横街社区社区图书室的书籍资源，满足不同年龄段居民的阅读需求。\n" + "    此次公益捐书活动进一步充实了社区图书室的藏书数量，满足了社区居民的阅读需求，营造了书香社区的良好氛围，给社区居民的精神文化生活增添了一笔属于爱心的红色。此外，结合党员进社区报到，公积金中心将持续开展各种形式的“心相莲·搭把手”文明实践志愿服务活动，进一步加强与社区的共建联系，实现资源共享，推动联点社区新时代文明实践站工作不断提升。\n",

	"    爱心助力，情暖冬日。2021年12月4日，一本书·爱心粥收书点首次“开张”，便迎来众多爱心人士的积极响应和参与。本次捐书活动共募集到895本爱心图书，这些图书经过筛选、消杀、扫码、入库等一系列环节后，将由河南省慈善总会·一本书公益基金以“一本书希望图书室”的方式捐赠到各个有需要的乡村小学。\n" + "    “让乡村孩子有喜欢的书可读，让孩子喜欢读书”。尽管天气寒冷，但在位于郑州市农业南路与众意西路的百家姓爱心粥屋却温暖无比。上午9点，活动开始后，前来捐书的爱心市民便络绎不绝，其中一些小朋友更是亲自挑选图书前来捐赠。“我今天带来了四本我最喜欢的图书分享给乡村的小朋友们，希望他们也可以像我一样喜欢读书。”今天8岁的赵卿雅一大早便第一个来到了粥屋，迫不及待地把心爱的图书捐了出去。\n" + "    活动现场气氛融洽而温馨，一本本精彩的图书，一句句真诚的祝福，一段段发自肺腑的读书感言，构成这个冬日最靓丽的风景。2021年4月23日，河南广播电视台新闻事业部爱之声工作室，联合北京家音顺达数据有限公司，在河南省慈善总会成立一本书公益基金，与此同时，“一本书·益起读”公益活动正式启动。一本书公益基金负责人、河南广播电视台新闻事业部爱之声工作室负责人穆迪在活动现场介绍，“今后每个月的第一个周六，一本书·益起读都将在众意路爱心粥、东风路爱心粥募集图书，期待更多爱心人士献出自己的爱心，捐出一缕书香，让乡村孩子在爱心中成长，在阅读中滋养向上生长的力量。”北京家音顺达数据技术有限公司是一本书公益项目的技术支持公司，董事长郑义在活动现场表示，公司将致力于募集城市优质的闲置图书送至乡村，并为乡村学校援建智慧图书室“一本书·希望图书室”，改善乡村学校阅读环境，助力乡村孩子“阅读自由”。\n",

	"    2023年4月23日世界读书日之际，中国儿童少年基金会肯德基小候鸟基金（以下简称“小候鸟基金”）举办“等候一本书——为远方的‘小候鸟’捐书吧”公益活动（以下简称“等候一本书”），发动广大爱心家庭捐出高质量的儿童绘本和优秀读物，让书香浸润孩子们的心田，为更多“小候鸟”们带去知识与快乐。首批20个“捐书角”已在北京、上海、海南、甘肃等15个省、19个市的肯德基定点餐厅开放，向公众募集童书。\n" + "    阅读，已经成为很多家庭的亲子必修课。一方面，随着儿童年龄的不断增长，阅读水平的提高，城市家庭闲置了越来越多的儿童读物；另一方面，大批留守、流动儿童优质阅读资源相对匮乏。小候鸟基金自成立以来，一直致力于通过开展阅读、艺术、体育等形式的活动，帮助全国各地的“小候鸟”们快乐健康成长，现在通过“等候一本书”活动，更好地将闲置书籍合理利用，让知识与爱流动起来。\n" + "    中国儿童少年基金会秘书长张彦红表示，一次捐赠，一本好书，可以在城乡家庭间架起一道爱的桥梁，帮助留守、流动儿童看见更广阔的世界。希望孩子们在阅读中开拓视野、陶冶情操、砥砺品格、增长本领。\n",

	"    为增强同学们的公益意识，充分利用闲置图书资源传送知识、传递爱心，帮助偏远地区的中学生拓展阅读量，10月27日至30日，中国社会科学院大学青年志愿者协会开展了“书送爱心，点亮梦想”图书捐赠活动，在同学们的热情参与下，本次捐书活动共收到322本图书，志愿者们认真细致地进行图书信息登记、分类整理工作，并在收集结束后将图书集中保存。\n" + "    作为承担图书登记工作的志愿者之一，20级博士张耘鸣表示：“同学们对捐书活动积极热情，有位热心同学一次捐了11本以文学名著为主的书籍，且保存得都很完整，有的同学连续捐了两天，也有位热心同学捐了7本心理学类的书籍，大家都希望能够尽己所能帮助到那些孩子们”。\n",
)

val actPainter = arrayListOf(
	R.drawable.ac1, R.drawable.ac2, R.drawable.ac3, R.drawable.ac4, R.drawable.ac5
)

val helpCenterTitle = arrayListOf(
	"如何买书？", "如何卖书？", "价格结算规则？", "常见问题"
)

val helpCenterSubtitle = arrayListOf(
	Triple("品相说明", "费用问题", "售后服务"), Triple("品相折算", "书籍要求", "回收方式"), Triple("污渍、水渍等问题", "珍贵书籍标准", "价格计算方式"), Triple("账号问题", "订单查询", "积分问题")
)